app/controllers/api/pins_controller.rb

SELECT "pins".* FROM "pins"
---
    def index
        @pins = Pin.all

SELECT  "pins".* FROM "pins" WHERE "pins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @pin = Pin.find(params[:id])

INSERT INTO "pins" ("title", "description", "url", "created_at", "updated_at", "user_id", "board_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "test"], ["description", "Test"], ["url", "test.com"], ["created_at", "2020-08-03 17:49:53.172390"], ["updated_at", "2020-08-03 17:49:53.172390"], ["user_id", "55"], ["board_id", "28"]]
---
    def create
        @pin = Pin.new(pin_params)

        if @pin.save