app/views/api/boards/_board.json.jbuilder

SELECT "pins".* FROM "pins" WHERE "pins"."board_id" = $1  [["board_id", 1]]
---
json.extract! board, :id, :name, :description, :secret, :user_id
json.pins board.pins.each do |pin|