app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "DGZSfV8GaX7o7tKU6xU0h1PsUNKm8CwRO5me89bcVMCnxWBs7Tv2o36LGBpOSTDP7//Se+cfW6HGzg/SZOv/2Q=="], ["LIMIT", 1]]
---
    def current_user
        return nil unless session[:session_token]
        User.find_by(session_token: session[:session_token])