app/models/user.rb

    def reset_session_token!
        self.session_token = self.class.generate_session_token
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "vR/IGlYs39+EIZ3ErwW7B3YLtp950zZMpdNXmFYekVirCWEQVCDRh8bM8Qjeq2iN1B4eBAJDKkxujKmaUMebUA=="], ["updated_at", "2020-07-31 15:03:33.420854"], ["id", 19]]